{
    "riddles": [
        {"riddle": "I am a three-digit number. My tens digit is five more than my ones digit, and my hundreds digit is eight less than my tens digit. What number am I?", "solution": "194"},
        {"riddle": "What number do you get when you multiply all of the numbers on a telephone's number pad?", "solution": "0"},
        {"riddle": "What number becomes zero when you subtract 15 from half of it?", "solution": "30"},
        {"riddle": "If I subtract 10 from a number and then double the result, I get 60. What is the number?", "solution": "40"},
        {"riddle": "What number, when doubled and then reduced by 10, equals 20?", "solution": "15"},
        {"riddle": "What number, when 8 is added to it, equals three times itself?", "solution": "4"},
        {"riddle": "If you subtract 4 from a number and then multiply the result by 5, you get 40. What is the number?", "solution": "12"},
        {"riddle": "I am a two-digit number. My tens digit is three times my ones digit, and the sum of my digits is 12. What number am I?", "solution": "93"},
        {"riddle": "What number, when multiplied by 2 and then reduced by 5, equals 15?", "solution": "10"},
        {"riddle": "What number, when 8 is added to it, equals its double?", "solution": "8"},
        {"riddle": "I am a three-digit number. My tens digit is 1 greater than my hundreds digit, and my ones digit is 2 less than my tens digit. The sum of my digits is 12. What number am I?", "solution": "453"},
        {"riddle": "What number, when divided by 4, gives the same result as when 6 is subtracted from it?", "solution": "8"},
        {"riddle": "What number, when squared, equals 121?", "solution": "11"},
        {"riddle": "What number, when added to its double, equals 18?", "solution": "6"},
        {"riddle": "What number becomes 30 when you add 20 to half of it?", "solution": "20"},
        {"riddle": "What number, when decreased by 4 and then multiplied by 3, gives 30?", "solution": "14"},
        {"riddle": "I am a two-digit number. The difference between my digits is 3, and the sum of my digits is 9. What number am I?", "solution": "63"},
        {"riddle": "I am a two-digit number. My ones digit is half my tens digit, and the sum of my digits is 12. What number am I?", "solution": "84"},
        {"riddle": "What number, when you subtract 9 from it, equals 9?", "solution": "18"},
        {"riddle": "What number is the sum of the first four prime numbers?", "solution": "17"},
        {"riddle": "What number do you get when you multiply the digits of 123?", "solution": "6"},
        {"riddle": "What is the result when you add the first five positive even numbers?", "solution": "30"},
        {"riddle": "What positive number becomes 0 when you subtract it from its square?", "solution": "1"},
        {"riddle": "What number do you get when you add the digits of 12345?", "solution": "15"},
        {"riddle": "I am a three-digit number. My hundreds digit is 2, my tens digit is 3, and my ones digit is the sum of my hundreds and tens digits. What number am I?", "solution": "235"},
        {"riddle": "What number, when tripled and then reduced by 7, equals 26?", "solution": "11"},
        {"riddle": "What is the smallest two-digit prime number?", "solution": "11"},
        {"riddle": "What is the difference between the squares of 6 and 4?", "solution": "20"},
        {"riddle": "If you reverse the digits of the number 21, what number do you get?", "solution": "12"},
        {"riddle": "What number results when you add the first three odd numbers?", "solution": "9"}
    ]
}